app/views/posts/index.html.erb

         <%= link_to(post_path(post)) do %>
          <%= image_tag post.photos.first.image.url(:medium), class: "card-img-top" %>
---
SELECT `photos`.* FROM `photos` WHERE `photos`.`post_id` IN (2, 1)