app/views/posts/show.html.erb

      <div class="card-left">
        <%= image_tag @post.photos.first.image.url(:medium), class: "card-img-top" %>
---
SELECT  `photos`.* FROM `photos` WHERE `photos`.`post_id` = 2 ORDER BY `photos`.`id` ASC LIMIT 1