app/controllers/comments_controller.rb

INSERT INTO `comments` (`comment`, `post_id`, `user_id`, `created_at`, `updated_at`) VALUES ('aaaaa', 1, 1, '2020-06-01 23:38:58', '2020-06-01 23:38:58')
---
  def create
    @comment = Comment.new(comment_params)
    @post = @comment.post
    if @comment.save

SELECT  `comments`.* FROM `comments` WHERE `comments`.`id` = 5 LIMIT 1
DELETE FROM `comments` WHERE `comments`.`id` = 5
---
  def destroy
    @comment = Comment.find_by(id: params[:id])
    @post = @comment.post
    if @comment.destroy