app/controllers/posts_controller.rb

INSERT INTO `photos` (`image`, `post_id`, `created_at`, `updated_at`) VALUES ('4_23その１.png', 1, '2020-06-01 18:46:02', '2020-06-01 18:46:02')
INSERT INTO `posts` (`explanation`, `user_id`, `created_at`, `updated_at`) VALUES ('aaaa', 1, '2020-06-01 19:09:18', '2020-06-01 19:09:18')
---
  def create
    @post = Post.new(post_params)
    if @post.photos.present?
      @post.save

SELECT  `posts`.* FROM `posts` ORDER BY created_at DESC LIMIT 8
SELECT `photos`.* FROM `photos` WHERE `photos`.`post_id` IN (2, 1)
---
  def index
    @posts = Post.limit(8).includes(:photos, :user).order('created_at DESC')

SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 2 LIMIT 1
---
  def show
    @post = Post.find_by(id: params[:id])

SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 2 LIMIT 1
DELETE FROM `posts` WHERE `posts`.`id` = 2
---
  def destroy
    @post = Post.find_by(id: params[:id])
    if @post.user == current_user
      flash[:notice] = "投稿が削除されました" if @post.destroy