app/models/post.rb

  def liked_by(current_user)
    Like.find_by(user_id: current_user.id, post_id: id)
---
SELECT  `likes`.* FROM `likes` WHERE `likes`.`user_id` = 1 AND `likes`.`post_id` = 1 LIMIT 1